export const coursesData = [
  {
    id: 1,
    title: 'Основы машинного обучения и нейронных сетей',
    description: 'Ведут специалисты из Яндекса с реальными кейсами из индустрии. Слушатели осваивают практические навыки построения нейронных сетей и работы с большими данными. Курс включает работу с реальными проектами и актуальными инструментами искусственного интеллекта.',
    url: 'https://practicum.yandex.ru/',
    provider: 'Яндекс',
    level: 'Начальный',
    created_at: '2025-06-22T09:07:32.811Z',
    updated_at: '2025-06-22T09:07:32.811Z',
    category: { name: 'Искусственный интеллект', id: 1 },
    grades: [
      { id: 1, level: 7 },
      { id: 2, level: 8 }
    ],
    startDate: '2025-07-01T00:00:00.000Z',
    endDate: '2025-09-30T00:00:00.000Z',
  },
  {
    id: 2,
    title: 'Python для искусственного интеллекта',
    description: 'Поможет подготовиться к участию в олимпиадах по программированию. Слушатели осваивают практические навыки построения нейронных сетей и работы с большими данными. Курс включает работу с реальными проектами и актуальными инструментами искусственного интеллекта.',
    url: 'https://example.com/advanced-js',
    provider: 'Сириус',
    level: 'Продвинутый',
    created_at: '2025-06-15T10:15:22.123Z',
    updated_at: '2025-06-20T11:20:33.456Z',
    category: { name: 'Веб-разработка', id: 2 },
    grades: [
      { id: 3, level: 9 },
      { id: 4, level: 10 }
    ],
    startDate: '2025-07-15T00:00:00.000Z',
    endDate: '2025-10-15T00:00:00.000Z',
  },

];